ERP DEV.WMS/src/InformationRegisters/вмс_СоответствиеОбъектамУчета/вмс_СоответствиеОбъектамУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_СоответствиеОбъектамУчета</name>
  <resources>
    <name>ЗначениеУчета</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗначениеВМС</name>
    <type>
      <types>CatalogRef.вмс_СерииНоменклатуры</types>
      <types>CatalogRef.вмс_ПартииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/Catalogs/вмс_СерииНоменклатуры/вмс_СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_СерииНоменклатуры</name>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоденДо</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияУчета</name>
    <type>
      <types>DefinedType.вмс_СерииНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/CommonModules/вмс_ВзаимодействиеСОбъектамиУчетаСервер/Module.bsl
Процедура СоздатьСоответствиеОбъектаВмс(Источник, Отказ) Экспорт  
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеОбъектаВмс = Метаданные.НайтиПоТипу(ТипЗнч(Источник));
	Если МетаданныеОбъектаВмс = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Если ЕстьСоответствиеОбъектаВмс(Источник) Тогда 
		Возврат;	
	КонецЕсли;   

	//ПолноеИмяОбмена = "Обмен с системой WMS";
	//ПользовательОбмена = Справочники.Пользователи.НайтиПоНаименованию(ПолноеИмяОбмена);
	//Если Пользователи.ТекущийПользователь() <> ПользовательОбмена Тогда
	//	Возврат;
	//КонецЕсли;

	ИмяРеквизитаНомерСерии = вмс_АдаптацияКонфигураций.ИмяРеквизитаНомерСерии();
	ИмяРеквизитаВладелецСерии = вмс_АдаптацияКонфигураций.ИмяРеквизитаВладелецСерии();
	
	ИмяОбъекта = МетаданныеОбъектаВмс.Имя; 	
	ИмяОбъекта = Сред(ИмяОбъекта, Найти(ИмяОбъекта, "_")+1);  
	Если Метаданные.Справочники.Содержит(МетаданныеОбъектаВмс) Тогда
		МенеджерЗначенияУчета = Справочники[ИмяОбъекта];
		ЗначениеУчета = МенеджерЗначенияУчета.ПолучитьСсылку(); 
		
		МенеджерЗаписи = РегистрыСведений.вмс_СоответствиеОбъектамУчета.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.Заполнить(Неопределено);
		МенеджерЗаписи.ЗначениеУчета = ЗначениеУчета;
		МенеджерЗаписи.ЗначениеВМС = Источник.Ссылка;  
		МенеджерЗаписи.Записать(); 
	
		СоответствиеУчета = МенеджерЗначенияУчета.СоздатьЭлемент();
		СоответствиеУчета.УстановитьСсылкуНового(ЗначениеУчета);
		СоответствиеУчета.Наименование = Источник.Наименование;
		СоответствиеУчета[ИмяРеквизитаНомерСерии] = Источник.Номер;
		СоответствиеУчета[ИмяРеквизитаВладелецСерии] = Источник.ВидНоменклатуры;
		СоответствиеУчета.ДатаПроизводства = Источник.ДатаПроизводства;
		СоответствиеУчета.ГоденДо = Источник.ГоденДо;

		СоответствиеУчета.Записать();	
	ИначеЕсли Метаданные.Документы.Содержит(МетаданныеОбъектаВмс) Тогда
		ТочкаОстановы=1;	
	КонецЕсли;	  
	
КонецПроцедуры

Функция ПолучитьИлиСоздатьОбъектВмсПоОбъектуУчета(ОбъектУчета) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектУчета) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СсылкаВмс = ПолучитьСоответствиеОбъектаУчета(ОбъектУчета);
	Если ЗначениеЗаполнено(СсылкаВмс) Тогда
		Возврат СсылкаВмс;
	КонецЕсли;
	
	СоздатьСоответствиеОбъектаУчета(ОбъектУчета, Ложь);
	
	Возврат ПолучитьСоответствиеОбъектаУчета(ОбъектУчета);
	
КонецФункции

Процедура СоздатьСоответствиеОбъектаУчета(Источник, Отказ, МетаданныеОбъектаУчета=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если МетаданныеОбъектаУчета=Неопределено Тогда
		МетаданныеОбъектаУчета = Метаданные.НайтиПоТипу(ТипЗнч(Источник.Ссылка));
	КонецЕсли;
	
	Если МетаданныеОбъектаУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьСоответствиеОбъектаУчета(Источник) Тогда 
		Возврат;	
	КонецЕсли;
	
	ИмяРеквизитаНомерСерии = вмс_АдаптацияКонфигураций.ИмяРеквизитаНомерСерии();
	ИмяРеквизитаВладелецСерии = вмс_АдаптацияКонфигураций.ИмяРеквизитаВладелецСерии();
	
	ИмяОбъекта = МетаданныеОбъектаУчета.Имя; 	
	Если Метаданные.Справочники.Содержит(МетаданныеОбъектаУчета) Тогда
		МенеджерЗначенияВМС = Справочники["вмс_" + ИмяОбъекта];
		ЗначениеВМС = МенеджерЗначенияВМС.ПолучитьСсылку();

		МенеджерЗаписи = РегистрыСведений.вмс_СоответствиеОбъектамУчета.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Заполнить(Неопределено);
		МенеджерЗаписи.ЗначениеУчета = Источник.Ссылка;
		МенеджерЗаписи.ЗначениеВМС = ЗначениеВМС;
		МенеджерЗаписи.Записать();
		
		СоответствиеВмс = МенеджерЗначенияВМС.СоздатьЭлемент();
		СоответствиеВмс.УстановитьСсылкуНового(ЗначениеВМС);
		СоответствиеВмс.ГоденДо = Источник.ГоденДо;
		СоответствиеВмс.ВидНоменклатуры = Источник[ИмяРеквизитаВладелецСерии];
		СоответствиеВмс.ДатаПроизводства = Источник.ДатаПроизводства;
		СоответствиеВмс.Номер = Источник[ИмяРеквизитаНомерСерии];
		СоответствиеВмс.Наименование = Источник.Наименование;
		
		СоответствиеВмс.Записать();	
	ИначеЕсли Метаданные.Документы.Содержит(МетаданныеОбъектаУчета) Тогда
		ТочкаОстановы=1;	
	КонецЕсли;
		
КонецПроцедуры

Функция ЕстьСоответствиеОбъектаУчета(ЗначениеУчета) Экспорт
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_СоответствиеОбъектамУчета.ЗначениеВМС КАК ЗначениеВМС
		|ИЗ
		|	РегистрСведений.вмс_СоответствиеОбъектамУчета КАК вмс_СоответствиеОбъектамУчета
		|ГДЕ
		|	вмс_СоответствиеОбъектамУчета.ЗначениеУчета = &ЗначениеУчета";
	
	Запрос.УстановитьПараметр("ЗначениеУчета", ЗначениеУчета.Ссылка);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультата.Количество() > 0;	
	
КонецФункции

Функция ПолучитьСоответствиеОбъектаУчета(ЗначениеУчета) Экспорт
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_СоответствиеОбъектамУчета.ЗначениеВМС КАК ЗначениеВМС
		|ИЗ
		|	РегистрСведений.вмс_СоответствиеОбъектамУчета КАК вмс_СоответствиеОбъектамУчета
		|ГДЕ
		|	вмс_СоответствиеОбъектамУчета.ЗначениеУчета = &ЗначениеУчета";
	
	Запрос.УстановитьПараметр("ЗначениеУчета", ЗначениеУчета.Ссылка);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Если ЗначениеЗаполнено(ТаблицаРезультата) Тогда
		Возврат ТаблицаРезультата[0].ЗначениеВМС;
	КонецЕсли;
	
КонецФункции  

Функция ЕстьСоответствиеОбъектаВмс(ЗначениеВМС) Экспорт
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_СоответствиеОбъектамУчета.ЗначениеУчета КАК ЗначениеУчета
		|ИЗ
		|	РегистрСведений.вмс_СоответствиеОбъектамУчета КАК вмс_СоответствиеОбъектамУчета
		|ГДЕ
		|	вмс_СоответствиеОбъектамУчета.ЗначениеВМС = &ЗначениеВМС";
	
	Запрос.УстановитьПараметр("ЗначениеВМС", ЗначениеВМС.Ссылка);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультата.Количество() > 0;	
	
КонецФункции

Функция СоздатьТипизированнуюСериюВмс(РеквизитыСерии) Экспорт
	// Типизация_18.08.25+
	НоваяСерия = Справочники.вмс_СерииНоменклатуры.СоздатьЭлемент();
	НоваяСерия.Заполнить(Неопределено);
	ЗаполнитьЗначенияСвойств(НоваяСерия, РеквизитыСерии);
	НоваяСерия.Наименование = вмс_СерииТоваровСервер.ПолучитьПредставлениеСерии(РеквизитыСерии);
	НоваяСерия.Записать();
	СсылкаНаСерию = НоваяСерия.Ссылка;
	
	Возврат СсылкаНаСерию;
	// Типизация_18.08.25-
КонецФункции
